[
    {
        "Category": "Sports",
        "Article": "Maxwell takes a break to refresh after asking to be rested by RCB play Glenn Maxwell has elected to take a break from the IPL to refresh himself physically and mentally after requesting Royal Challengers Bengaluru management pick someone else in his place for the match against Sunrisers Hyderabad. Maxwell has been struggling for runs in IPL 2024. Before Monday's game, he had scored only 32 runs in six innings at an average of 5.33. There were speculations that he might have sat out because of a thumb injury but that was not the case. \"For me, personally, it was a pretty easy decision,\" Maxwell said after RCB's sixth defeat in seven matches. \"I went to Faf [du Plessis] and the coaches after the last game and said I felt it was probably time we tried someone else. I have been in this situation in the past where you can keep playing and get yourself deeper into a hole. I think now is actually a good time for me to give myself a bit of a mental and physical break, get my body right. If I'm required to get in during the tournament, I can hopefully get back into a really solid mental and physical space where I can still have an impact. \"We have had a pretty big deficiency straight after the powerplay, which has been my area of strength over the last couple of seasons. I felt like I wasn't contributing in a positive way with the bat, and with the results and the position we find ourselves on the table, I think it's a good time to give someone else an opportunity to show their wares, and hopefully, someone can make that spot their own.\" Coming into IPL 2024, Maxwell was in red-hot form. In 17 T20s since the start of November, he had 552 runs at an average of 42.46 and a strike rate of 185.85. During this period, he scored two hundreds as well. But he started the IPL with a first-ball duck against Chennai Super Kings. Since then, he has had two more ducks and has lasted more than five balls only once - against Kolkata Knight Riders, when he made a 19-ball 28 with the help of two dropped catches. \"T20 cricket can be like that sometimes - it's a pretty fickle game,\" he said. \"Even if you look at the first game, I ran one off the middle of the bat to the keeper. I picked up the length really well, saw a scoring opportunity, but opened the face a little bit too much. When you are going well, that goes wide of the gloves, you get a boundary, you are 4 off 1, and you are away for the tournament. \"I probably just haven't got away - it's as simple as that. In the first few games, I feel I made reasonably good decisions, but I was still finding ways to get out. It can happen in T20 cricket and when it snowballs like that, you can go searching and try too hard and forget the basics of the game.\" The SRH game, though, turned out to be a high-scoring one. Batting first, SRH posted 287 for 3, the second-highest total in T20 cricket. RCB replied with 262 for 7, making it 549 for the match, the most for a T20. play 2:12 Inside Glenn Maxwell's battle to find form at the IPLThe Australia allrounder talks about how he goes about training, going from a 'shocker' of net one day to one of his best the next Maxwell was asked if, in hindsight, he wished he had played one more game. \"I did notice during the powerplay that the pitch was not as slow and two-paced as it has been in the first few games,\" he said with a smile. \"And I realised it was probably a bad game to miss; it would have been nice to be out there batting. \"But as I said, I wanted to give myself not just the physical break but also the mental break to give myself the right to play professional cricket. I take a lot of pride in my performance, and I put in a lot of hard work behind the scenes to get my body right for every game. And it has been a pretty tough struggle, given my body is on the wrong side of 30. I think that physical and mental toll probably just wore me down a little bit.\" Maxwell had a similar IPL season in 2020 as well. Playing for Kings XI Punjab then, he managed only 108 runs in 11 innings, at an average of 15.42 and a strike rate of 101.88. He did not hit a single six that year. \"That was probably a different scenario,\" Maxwell said. \"Back then the thing that was hurting me was I was bowling really well. So I was actually playing more as a spinner who was used at the back end [with the bat]. We had KL [Rahul] and Mayank [Agarwal] who were the two leading run-scorers in the competition at that time, so there wasn't a lot of balls left in the game. So I wasn't able to get any match rhythm. And when I was, it was only for a few balls here and there. \"So I said the same thing to the Kings XI management back at the time, that we can have an overseas bowler in my place. But we didn't have an offspinner as well. So I sort of played as an overseas offspinner who could bat a little bit. \"The management here has been outstanding. We've been working together on taking a fair bit of ownership and the off-field leadership staff is trying to help out as much as they can. Unfortunately, runs just haven't come the way they should have when you are in really good form. I don't think I've had a better six months in cricket leading into this tournament. So it's frustrating when it ends up like this. But if I can get my body and my mind right, there's no reason I can't finish the tournament well if I do get another opportunity.\""
    },
    {
        "Category": "Sports",
        "Article": "Pat Cummins, Nat Sciver-Brunt named as Wisden's Leading Cricketers in the World Pat Cummins is jubilant after leading Australia to victory AFP/Getty Images Pat Cummins and Nat Sciver-Brunt have been named as the Leading Cricketers in the World in the 2024 edition of Wisden Cricketers' Almanack, published on Tuesday. Cummins, Australia's fast-bowling spearhead and captain across formats, guided his side to victory over India in both the ICC World Test Championship at The Oval in June, and the 50-over World Cup in Ahmedabad in November. He also oversaw his side's successful defence of the Ashes, in last summer's enthralling 2-2 drawn series in England. He is the first Australian man to be named as Wisden's Leading Cricketer since Michael Clarke in 2012, and succeeds his England counterpart Ben Stokes, who had claimed the honour three times in four years, in 2020, 2021 and 2023. Lawrence Booth, Wisden's editor, said: \"After captaining Australia to success in the World Test Championship, Pat Cummins retained the Ashes - thanks in no small part to his late-order runs in the First Test at Edgbaston - then led Australia to victory in the World Cup final in India. In 2023, no other seamer in world cricket took more than his 42 Test wickets.\" Sciver-Brunt, meanwhile, has been recognised as the pre-eminent women's cricketer of the moment, particularly in light of her starring role in the Women's Ashes, in which she produced back-to-back ODI centuries to take the multi-format series to the wire. She followed those performances with an England-record 66-ball hundred against Sri Lanka, while her global appeal was recognised by Mumbai Indians at the inaugural Women's Premier League auction in February, where her £320,000 price tag made her the UK's best-paid female team athlete. The thrilling nature of both the Men's and Women's Ashes, which were played concurrently in June and July 2023, is reflected in the Anglo-Aussie flavour to Wisden's Five Cricketers of the Year - an honour a player can only win once in their career and which is judged by their performance during the English home season. Three Australians are named among the Five, including the allrounder Ashleigh Gardner, whose 12 wickets in the one-off Women's Test at Trent Bridge were instrumental in her team's retention of the Ashes. She is the tenth female recipient of an honour that dates back to 1889, and the first Australian woman to be named as a Cricketer of the Year since Ellyse Perry in 2020. The other Australians in the Five are Usman Khawaja, the leading run-scorer in the Men's Ashes with 496 runs at 49.60 including a series-defining hundred at Edgbaston, and Mitchell Starc, the leading bowler with 23 wickets at 27.08, who also claimed 16 wickets in the World Cup triumph. Harry Brook, England's break-out star of the 2022-23 winter, is also named alongside Mark Wood, whose selection for the third Test at Headingley last summer was the catalyst for England's stirring fightback in the series. \"Wood turned the Ashes on its head,\" Booth said. \"He topped 96mph, took five for 34, and pushed Australia on the back foot, literally and figuratively. In all, he claimed 14 wickets at just 20 apiece as England came from 2-0 down to square the series.\" Travis Head, meanwhile, has been awarded the Wisden Trophy for the year's best Test performance, following his match-seizing innings of 163 from 174 balls in the World Test Championship final. He succeeds Jonny Bairstow as the second winner of Wisden's newest award, with the trophy having previously been contested during England-West Indies Test series from 1963 to 2020, until it was succeeded by the Richards-Botham Trophy. The other notable award in this year's publication goes to the West Indian Hayley Matthews, who is the first female to be named the Leading Twenty20 Cricketer, after a run of eight consecutive T20I match awards, in which period she averaged 88 with the bat, at a strike-rate of 144, and 12 with the ball. The compelling nature of the Ashes battle is an enduring theme of this year's Almanack, with Booth making the point in his Notes by the Editor that England's ultra-attacking \"Bazball\" approach to the series has already ramped up demand for this summer's Test series against West Indies. \"Amid the gloomy outlook for Test cricket, here was a glimmer of hope: proof that if you put on a show, bums will fill seats,\" he wrote. \"And the 2023 Ashes were a show all right, up there with 1981 and 2005. But for rain in Manchester, it might even have rivalled Australia's Don Bradman-inspired 1936-37 victory, still the only series in Test history won by a team who had trailed 2-0. \"The scoreline was almost secondary. For the first time since English cricket vanished behind a paywall, it felt like the people's sport: Bazball was on their lips and, before long, in the Collins Dictionary.\" Fittingly, the series was capped by the last hurrah of one of the most enduring Ashes competitors of modern times, Stuart Broad, who claimed his 604th and final Test wicket with the last ball of the series to bow out on a high. In his Notes, Booth salutes him as \"England's maker of memories\". \"The best players don't simply rack up the numbers (though his final tally made you tired just thinking of it),\" Booth wrote. \"They leave an impression. Even more than [James] Anderson, Broad was England's maker of memories, the curator of the family album. A rule of thumb emerged: if Broad's knees were pumping, so was England's blood.\" Elsewhere in his Notes, Booth appeals for a reappraisal of the so-called Spirit of Cricket, a concept that came under intense scrutiny following Bairstow's controversial stumping during the Lord's Test, and criticises the game's administrators for undermining the competitive nature of international cricket with an increasingly inequitable split of the ICC's revenues. \"In the era of global television, the West Indians have been hardest hit among the major Test teams,\" Booth wrote. \"India's slice of the pie had grown from less than 25% to 38.5%, or close to $230m a year … West Indies receive 4.58%, or $27.5m. \"Yet this is where cricket finds itself, in dreary thrall to the notion that market forces must be obeyed, while patronising the West Indian game with back-handed compliments, when what it needs is hard cash. There's plenty of that in cricket's central pot. Is it really beyond the wit of the administrators to distribute it according to need, not greed?\""
    },
    {
        "Category": "Sports",
        "Article": "Gloucestershire report Â£1.19 million shortfall in latest club accounts Heavy rain forced an abrupt abandonment Getty Images Gloucestershire's viability as a first-class county has been cast into renewed doubt after the club reported a loss of £1.19 million in their annual accounts, published on Monday, which is more than twice the shortfall of £570,000 that they accrued in 2022-23. In her report, Gloucestershire's Treasurer Rebecca Watkin insisted that the club's outlook for 2024 and 2025 was more positive, but blamed the current situation on the cost-of-living crisis that has raised the club's day-to-day running costs, allied to the washed-out ODI between England and Ireland in September, which would ordinarily have been a vital source of revenue, given the club's non-Test and Hundred-hosting status. \"This has been a challenging year financially for a number of reasons and there is no doubt it is disappointing to be reporting a second consecutive financial deficit,\" Watkin wrote. \"Gloucestershire has experienced a tumultuous couple of years both on and off the field but despite that, we remain committed to pushing for success on the field with inspiring, competitive cricket, and will ensure all that can be done is done to return improved financial results in the years to come.\" In December, Gloucestershire's board had floated the possibility of selling up the club's historic Nevil Road ground, which has been their home since WG Grace assisted with its purchase in 1889 and could now be worth between £25 and £40 million, and moving to a new out-of-town venue near the junction of the M4 and M5. That prospect could be one step closer now, following an independent audit by chartered accountants, Saffery LLP, which revealed net liabilities of £5,019,000, leaving Gloucestershire in breach of its banking covenants and casting \"significant doubt on the Club's ability to continue as a going concern\". A number of contributory factors were cited in the accounts, including a £67,000 increase in energy bills across four months, and an extra £43,000 in interest-rate payments. The annual £4 million funding that the club receives from the ECB is, Watkin added in her report, effectively worth around £750,000 less in real terms compared to four years ago, while other ventures - including a Ministry of Sound dance party held at the ground in July - \"did not deliver the financial returns predicted\". In his own report, David Jones, the club chair, described the year as a \"rollercoaster\", with Gloucestershire's rock-bottom finish in the 2023 County Championship compounding their off-field struggles. However, with the bidding process now underway for the Women's World Cup in 2026, he insisted the club remained well placed to ensure Bristol retained its status as a host city for such marquee events. On the prospect of the ground relocation, Jones reiterated the club's need to remain \"open-minded\" in spite of the weight of history at the Nevil Ground, adding that the opportunity to relocate to a new, purpose-built and larger site would allow Gloucestershire to \"flourish for future generations\". A formal update on the relocation plans are anticipated in May or June, following further discussions at the club's AGM on April 29."
    },
    {
        "Category": "Sports",
        "Article": "Injury-hit Capitals look to throw a wrench into Titans' campaign Rishabh Pant and Jake Fraser-McGurk set up the chase for Delhi Capitals Associated Press Match details Gujarat Titans (GT - 6th; P6 W3 L3) vs Delhi Capitals (DC - 9th; P6 W2 L4) Ahmedabad, 7.30pm IST (2pm GMT) Big picture - Gill's Titans vs Pant's Capitals Just two points separate Gujarat Titans and Delhi Capitals, and yet they are three places apart in the points table. Titans are sixth, and like last year, have won and lost three each out of their first six games. Shubman Gill, their highest run-getter so far, has led them from the front. Another positive for Titans is Rashid Khan returning to form. Rashid had started this IPL with four wickets at 36.25 and an economy of 9.06. But in the last two matches, he has hit back with two wickets at 23, while going at only 5.75 runs an over. What will also please Titans is that Rashid has kept Capitals' captain Rishabh Pant quiet as well. Rashid has allowed Pant only 94 runs off 87 balls across all T20s. But like Gill, Pant has also shown the way for his side even as Capitals are ninth. So far, Pant has 194 runs at a strike rate of 157, having already shown shades of his best with two half-centuries, and some typically funky swipes and swats. Capitals brought their campaign back on track by beating Lucknow Super Giants last week. Jake Fraser-McGurk starred with a fifty in that game, while Kuldeep Yadav, returning from an injury, pushed LSG back with 3 for 20. But Capitals now have injury concerns around David Warner, who was hit on his finger while batting against LSG. Warner is unlikely to start against Titans, who will be wary that things could get interesting heading into the second half of the season if Capitals beat them on Wednesday. Form guide (Last five matches; most recent first) Gujarat Titans WLLWL Delhi Capitals WLLWL Team news and Impact Player strategy Gujarat Titans David Miller, who has missed three games due to a niggle, practiced in the nets two days out from the match. If Miller is available against Capitals, Titans might drop Matthew Wade. The wicketkeeping gloves would, then, go back to Wriddhiman Saha, who sat out of Titans' previous two fixtures due to a back spasm. Saha batted for a lengthy period at practice, while also keeping wicket, thus indicating that he is all but set to start against Capitals. Against Rajasthan Royals, Titans finally picked M Shahrukh Khan after he spent the season on the bench despite being signed for INR 7.4 crore. Coming on as Impact Sub for Mohit Sharma, he smashed 14 from eight balls in what turned out to be a last-ball win for Titans. They could continue to use the same pair, with who replaces whom depending on whether Titans bat or bowl first. Probable XII: 1 Shubman Gill (capt), 2 Wriddhiman Saha (wk), 3 Sai Sudharsan, 4 Vijay Shankar, 5 David Miller, 6 Rahul Tewatia, 7 Rashid Khan, 8 Noor Ahmad, 9 Umesh Yadav, 10 Spencer Johnson, 11 Mohit Sharma, 12 Shahrukh Khan Delhi Capitals It is understood that Warner experienced some swelling and underwent scans upon landing in Ahmedabad. That compounds Capitals' injury issues, after Mitchell Marsh went back to Australia on suffering a partial hamstring tear. If Warner is absent, Capitals might start with Abishek Porel if they bat first and with Jhye Richardson if they chase. Probable XII: 1 Prithvi Shaw, 2 Abishek Porel, 3 Shai Hope, 4 Rishabh Pant (capt & wk), 5 Tristan Stubbs, 6 Axar Patel, 7 Jake Fraser-McGurk, 8 Kuldeep Yadav, 9 Mukesh Kumar, 10 Ishant Sharma, 11 Khaleel Ahmed, 12 Jhye Richardson In the spotlight The top three wicket-takers last IPL were all from Titans. One of them, Mohit Sharma, has had a good time this season too. In the absence of Mohammed Shami and some support from Hardik Pandya, Mohit is Titans' leading wicket-taker this year. His eight wickets have come at 27, although he has been taken for 9.39 runs an over. But when Mohit is bowling in Ahmedabad, the average slides down to 13.03, and the economy to 7.82. So expect Mohit to have an impact with his variations again. Jake Fraser-McGurk turned 22 a day before taking Capitals to a win on his IPL debut, when he clubbed 55 from 35 balls. But he's enjoying some stardom already. Last October, Fraser-McGurk thrashed a List A century off just 29 balls, beating AB de Villiers' record of 31 deliveries. This February, in just his second ODI for Australia, he thumped 41 from only 18 balls against West Indies. With Marsh and Warner missing, Fraser-McGurk can provide just the spark Capitals need to move up the table. Stats that matter Since 2022, only three batters have scored at least 1000 runs in the IPL while averaging 40-plus and striking at above 140. Gill, one of those batters, has been the best across all three metrics. Tristan Stubbs, another of Capitals' in-form batters, has the upper hand over Rashid. Stubbs has faced nine balls from the Titans legspinner in T20s, but has smashed 22 runs off them - including three sixes. Some of Capitals' bowlers will want to be careful in case Miller is fit to play for Titans. Miller has a strike rate of 288 against Ishant Sharma, whom he has smacked for two fours and three sixes in nine deliveries in T20s. Mukesh Kumar, on the other hand, has been pumped for 24 off eight balls. Miller also strikes at 171 and 168 against Khaleel Ahmed and Axar Patel, respectively. Pitch and conditions Ahmedabad saw scores of 168 and 162 batting first in two matches, but that went up to 199 when Titans were playing Punjab Kings. The last two games were won by the chasing team, even as the first one was lost only by six runs. So expect the side winning the toss to bowl first."
    },
    {
        "Category": "Sports",
        "Article": ""
    },
    {
        "Category": "Sports",
        "Article": "Bayern's season a failure without Champions League title - Kane play Harry Kane has said he is still motivated by proving his critics wrong but admitted Bayern Munich's season will be a failure if they cannot win the Champions League. Bayern host Arsenal in Wednesday's quarterfinal, second leg at the Allianz Arena with the tie evenly poised at 2-2 from last week's first game. - Stream on ESPN+: LaLiga, Bundesliga, more (U.S.) Kane began his youth career at Arsenal but was released by the club aged nine and has previously spoken about the impact it had on his career, saying it instilled a determination to push himself that contributed to a record of 15 goals in 20 games against the north London club. The 30-year-old became the all-time record goalscorer in north London derbies before leaving Tottenham for Bayern last summer in a deal worth up to €120 million ($128m). When asked at a news conference on Tuesday if he still felt the same determination to prove Arsenal wrong, Kane said: \"I think it was one of the biggest games of the season for pretty much my whole career, we played them at least twice a year for the last 10 years and it was always a big occasion, big moment. \"Maybe it was in the back of the mind, being released from a young age, and there's always a point to prove -- I'm the type of player who, throughout my career, has had points to prove along the way. I don't think that ever leaves you. I think it'll always be in my DNA until I retire. \"There'll always be a reason to prove someone wrong or to prove to myself I can do something, so I don't think specifically back to that and think 'I was released when I was 9 years old, I really have to make a difference tomorrow.' \"Now I'm here at Bayern Munich it's just about being a top team in the Champions League. Of course I have history with them [Arsenal], but all I can do is try and help Bayern Munich qualify for the semifinal of the Champions League.\" Bayern missed out on the Bundesliga title for the first time in 12 years as Bayer Leverkusen lifted the trophy last weekend and Kane said: \"Of course, from the club's point of view it will be a failed season if we don't win anything this year because we're expected to win, but then all you can do it take that into next year and try to turn that around. \"So I think that's a harsh reality in winning and losing, you can do a lot of good things throughout the year and still end up on the losing side so I don't think it's as harsh as that, there's a lot of things that go into it but I think the main thing for us right now is that we still have an opportunity to turn the season into a great season if we win the Champions League.\" Bayern boss Thomas Tuchel believes his team's greater pedigree in the competition gives them the edge ahead of Wednesday's second leg. Arsenal are playing in the Champions League for the first time in seven years and have not reached the semifinals since 2009. Six-time winners Bayern last won the competition in 2020 but they have lost at the quarterfinal stage in each of the past three seasons. \"I think we have the slight advantage of experience in our team,\" said Tuchel, who lifted the trophy a year later with Chelsea, defeating Manchester City in the final. \"We have players who have won it, we have players who have played decisive matches in this competition. But to make in an advantage, we still have to bring out our very best. \"It can also sometimes be an advantage not to have the experience and have the role as contenders, the role as a hunter. That can be something for Arsenal. To go for it after so many years. \"Also for us it's not so usual for us to be in a semifinal. If you see the last years it's not so easy for us, or anyone, to overcome this stage. Now the situation is here that we have one decisive match to make the next big step in this beautiful competition. \"We are determined to bring everything to the table. If the experience within our group brings us an extra 5% we are happy to bring it to the table. \"But we have to bring it. Nobody will give us anything. It's like this in this competition. It's super tough.\""
    },
    {
        "Category": "Sports",
        "Article": "Manchester City boss Pep Guardiola 'doesn't fear' Real Madrid play Pep Guardiola looks ahead to Manchester City's huge Champions League semifinal second leg clash with Real Madrid. (2:04) MANCHESTER, England -- Manchester City manager Pep Guardiola says he \"doesn't fear\" 14-time Champions League winners Real Madrid ahead of their quarterfinal second leg. City have faced Real Madrid in each of the last three seasons, knocking them out in the semifinals a year ago but losing at the same stage in 2022. - Stream on ESPN+: LaLiga, Bundesliga, more (U.S.) Real Madrid have reached at least the last four in 11 of the last 13 seasons, but Guardiola insists he's not concerned about their stellar record in the competition ahead of the make-or-break game at the Etihad Stadium on Wednesday. \"I don't fear them,\" Guardiola told a news conference on Tuesday. \"I respect them a lot. I've faced them many times. I respect Real Madrid and if I say I'm scared of them, I would be false. \"There's the rivalry, you want to beat them and do well. Sometimes you win and sometimes you lose. But I'm not scared of them and if they beat me -- as has happened many times -- we will say congratulations and wish them well.\" After last week's 3-3 draw in the first leg at the Bernabéu, there have now been 23 goals in the last five meetings between the two teams. City beat Real Madrid 4-0 at the Etihad in the semifinal second leg last season, but Bernardo Silva insists this version of Carlo Ancelotti's team is better. \"Two different seasons, and it never happens the same game in football again,\" said Silva. \"I feel Madrid is stronger this season than last season. That was my feeling when we played them at the Bernabeu [last week]. For sure they will want a bit of revenge [for the result in Manchester last season] so it will be a very difficult game.\" After making history last season by becoming only the second English team to win a Premier League, Champions League and FA Cup treble, City remain on course to repeat it this year. Two consecutive trebles would make Guardiola's side a contender for the title of the greatest club team in history and Silva has admitted that the prospect is providing motivation for the City squad. \"It's obviously an inspiration,\" he added. \"We know how well this team has done and we want to create that legacy and to do another Premier League to do six in seven years and four in a row and we want to win the Champions League to do two in a row and if we win two trebles in a row that would be legacy. \"In one week we could be out of all the competitions but we are fighting for it.\""
    },
    {
        "Category": "Sports",
        "Article": "Pochettino slams Chelsea kids for penalty feud in win over Everton play Steve Nicol explains why Mauricio Pochettino was correct in his strong condemnation of Nicolas Jackson and Noni Madueke for their penalty feud. (2:20) A 6-0 win -- including a four-goal night by one of his star players in Cole Palmer -- should have left Chelsea manager Mauricio Pochettino with no issues following the game. But that was far from the case, as the Argentine coach took his team to task for an incident regarding who would take a penalty kick in the second half with Chelsea already up 4-0 on Everton on Monday night at Stamford Bridge. - Stream on ESPN+: LaLiga, Bundesliga, more (U.S.) Captain Conor Gallagher had to intervene to shove away Nicolas Jackson and Noni Madueke as they squabbled for the ball after the latter was brought down in the box. Gallagher secured the ball then handed it to Palmer, the team's designated penalty taker. \"The players and staff know that Cole Palmer is the penalty taker,\" said a furious Pochettino after the game. \"I am so, so upset about the situation. Discipline is the most important thing in our team. \"We all agree they [Jackson and Madueke] were wrong. They are not experienced players. They are young. It was very good the reaction by Conor Gallagher [to defuse things].\" \"We can't show that type of behaviour,\" he continued. \"It's like we are in a school, and our job is to show them they were wrong so they can learn. There will be no punishment, but this can't happen again. If Palmer is on the pitch, he is the penalty taker.\" Pochettino went on to apologize for the incident and the \"bad image\" of the club that it presented. Palmer calmly slotted home the penalty -- bringing his tally to a perfect 9-for-9 from the spot this season -- to make it 5-0 and move alongside Manchester City's Erling Haaland at the top of the Premier League scoring charts with 20. The goal also brought Palmer's tally in all competitions to 23 as he became the first Chelsea player to reach 20 since Eden Hazard in 2018-19. \"He was a player always with the capacity to score when at Manchester City, but I think the way he has adapted himself is fantastic,\" Pochettino said of Palmer. \"He is amazing for the team, for him, and he is showing that the club made the right decision in signing him. \"Overall, I am happy with the performance. We showed a different approach than against Sheffield United [a 2-2 draw last Sunday]. We improved in different areas, and today was the perfect game.\" - When players fight over penalties: Ronaldo, Neymar, Mbappé's spot-kick spats With Chelsea, who have struggled all season in Pochettino's return to England, finally rounding into form and chasing the European places in the Premier League, the former Tottenham Hotspur coach said it was time for his team to grow up and learn from its mistakes. \"It's impossible after a performance like this to have this type of behavior that shows that we are in a process, and we will learn a lot,\" Pochettino added. \"We are a great team fighting for big things. We need to change and think more in a collective way. \"I thought we behaved like kids today. When this happens, we need to learn and learn quick. Perform like today but behave much better.\" The result keeps Chelsea in ninth place on 47 points but only trailing the teams in front of them by three and with games in hand as they look to move up the table before the season finale on May 19. Information from Reuters was used in this story."
    },
    {
        "Category": "Sports",
        "Article": "Werder Bremen suspend Keita for refusing to travel with team play Kasey Keller reacts to Bayer Leverkusen winning their first Bundesliga title with five games left to play. (1:06) Former Liverpool midfielder Naby Keita has been suspended by Werder Bremen until the end of the season after he refused to play for the team on Sunday having found out he wasn't in the starting lineup for their match at champions Bayer Leverkusen. Keita, 29, has also been handed a \"substantial fine\" by the Bundesliga side. - Stream on ESPN+: LaLiga, Bundesliga, more (U.S.) Werder Bremen said the midfielder \"chose not to travel to the ground with the team and decided to go home instead\" after finding out he was not in Ole Werner's starting XI for Sunday's match in Leverkusen. Werder Bremen would go on to lose the match 5-0, a result which secured Bayer Leverkusen's first German league title in their 120-year history. Talking after the match, Werner said Keita would have to face the \"consequences\" for his decision. It has been a frustrating season for Keita, who moved to Werder Bremen on a free transfer last summer after five years at Liverpool. He has made just five Bundesliga appearances this season in an injury-filled campaign."
    },
    {
        "Category": "Sports",
        "Article": "Ante Budimir's unreal penalty miss sees Osasuna lose to Valencia Ante Budimir missed what may be the worst penalty kick of his career -- and indeed of the entire LaLiga season -- as his embarrassing stumble cost Osasuna in a 1-0 home loss to Valencia on Monday. Budimir was awarded the disputed spot kick in the fourth minute of stoppage time, and the penalty was upheld after a long video consultation. But the Croatia striker barely made contact with the ball and it trundled into the arms of the disbelieving goalkeeper. - Stream on ESPN+: LaLiga, Bundesliga, more (U.S.) Osasuna's top goalscorer this season with 16, Budimir adopted a stop-start approach to the kick, but it failed miserably in a dramatic end to the match. \"He has apologized three times to me and he doesn't have to ask for forgiveness,\" Osasuna coach Jagoba Arrasate said. \"It's inevitable that we'll remember this play. That's part of the game.\" André Almeida's angled drive in the 18th minute put Valencia ahead and proved to be the difference between the sides. Valencia rose to seventh place, three points behind Real Sociedad in the last of the European spots. Osasuna remained 11th, equal on points with the two teams above it, Villarreal and Getafe. Information from The Associated Press was used in this story."
    },
    {
        "Category": "Sports",
        "Article": "Swiss Open 2024: Lakshya leads Indian contingent chasing Olympic qualification spots Lakshya Sen in action during the 2023 BWF World Championships in Copenhagen, Denmark. Shi Tang/Getty Images The BWF Swiss Open kicks off the final 40 days of the qualification window that the Badminton World Federation [BWF] have set out for the Paris Olympics, and battles for a ticket to the big one are gaining pace now. The window, which started on May 1, 2023 will close on April 28, 2024. Before we proceed, though, a reminder of how many athletes will go to Paris -- 35 athletes each in the two singles events. If two athletes from the same country have to qualify, they both must be in the top 16 of the BWF Race to Paris (RTP) rankings by the end of April. Meanwhile, the list is shorter for doubles, with 16 teams each going to Paris across the three doubles disciplines. Only two teams per country are allowed, and that is only if the two teams are ranked in the top 8 of the RTP. We look at India's prospects discipline-wise, and with a sharper context of the upcoming BWF Swiss Open 2024 in mind: Men's Singles HS Prannoy's ticket to Paris is already booked, so his decision to take time off and focus on physical recovery makes sense. It's the second spot, though, where it gets tricky. Lakshya Sen is in the top 16, just. Ranked RTP #15 after two stunning runs to the semifinals in the French Open and All England Championship, he needs to keep his new-found momentum to stay within the qualification zone. The next closest Indian is Kidambi Srikanth, who's RTP #26. He needs to go on a strong run, starting at the Swiss Open, to seriously challenge for a spot. In Basel, Lakshya will start against Leon Jun Hao of Malaysia before a potential second-round match against the in-form Frenchman Christo Popov. Win that, and he could be in for a potential quarter against top-seed Lee Zii Jia (or Srikanth). Srikanth starts against Wang Tzu Wei before a likely second-round clash against LZJ. There's more Indian interest, though, with Priyanshu Rajawat (RTP #32) taking on fourth seed Lee Cheuk Yiu of Hong Kong and Kiran George (RTP #35) taking on Takuma Obayashi of Japan in the opening round. Women's Singles PV Sindhu is currently RTP #13 and with the next Indian ranked #40 (Aakarshi Kashyap), she should have a straightforward march to Paris. But after having shown glimpses of returning to her old self in Paris and Birmingham over the past fortnight, she'll want a deep run in Basel to keep that mojo going. Seeded fourth, she starts off with a clash against Yvonne Li (who retired hurt against Sindhu last week at All England). A win there and Japan's Tomoko Miyazaki awaits... but a tougher test would be in the quarters where she takes on Paris-chasing Aya Ohori (RTP #11, second-highest Japanese player, seven places below Akane Yamaguchi and just six above Nozomi Okuhara) or Paris-chasing Busanan Ongbamrungphan (RTP #20, one place below Pornapawee Chochuwong and six below Ratchanok Intanon) Aakarshi, meanwhile, starts with a tough draw against Michelle Li. Win that and one of Okuhara or Intanon await her in the second round. Men's Doubles World no. 1 Satwiksairaj Rankireddy and Chirag Shetty are RTP #2 and have their Paris berths sealed. They, like HSP, are skipping this tournament to focus on recovery. With that, there will be no Indian presence in MD at Basel. Path to Paris: After historic 2023, 'hungry' Sat-Chi embrace pressure, master the mind games Women's Doubles This here is a two-way battle between Tanisha Crasto-Ashwini Ponnappa (RTP #20) and Treesa Jolly-Gayatri Gopichand (RTP #26) to see who'll go. With only a max of two teams per country allowed, it is almost a certainty that whoever of Ash-Tan and Gaya-Tree finish the RTP higher will go to Paris. (For instance, China have five teams in the top 20, Japan have another five, South Korea have three). Ash-Tan begin their campaign against Rose-Puspitasari of Indonesia before a potential second-round match against Japan's Hirokami-Kato (RTP #30). On paper, the draw gives them a relatively straightforward run to the semis where they're likely to face top seeds (RTP #9) Rahayu-Ramadhanti of Indonesia. Incidentally, the top seeds get going against another Indian pair, the Panda sisters Rutuparna and Swetaparna (#48 in RTP). Gaya-Tree are on the other side of the draw and start against Annie and Kerry Xu of the USA, before a possible second-round meeting with compatriots Priya Konjengbam and Shruti Mishra (RTP #75). Their side of the draw is stacked with Paris-chasing Kusuma-Pratiwi (RTP #18, second-highest ranked Indonesian pair) a potential quarterfinal opponent and Denmark's Fruergaard-Thygsen (RTP #22) or Nakanishi-Iwanaga (RTP #12, fourth highest ranked Japanese team) potential semifinal opponents. Women's doubles is the most heavily represented event for Indians in Basel, with Ashwini Bhat - Shikha Gautam (RTP #59) making it five Indian pairs. Bhat-Gautam have a tough opener, taking on RTP #17 Yeung-Yeung of Hong Kong. Mixed Doubles There's no Indian participation at the Swiss Open, and there's next to no chance there will be Indian participation at the Olympics in this event - the highest ranked Indians are Satish Karunakaran and Aadya Variyath, and they're #44 in the RTP."
    },
    {
        "Category": "Sports",
        "Article": "2024 All England Championships takeaways: Lakshya's resurgence, Sindhu's positives, Sat-Chi's warning A return to basics has resulted in Lakshya Sen's uptick in form - with the Paris Olympics looming closer. Shi Tang/Getty Images Another All England Championship has come and gone and India's wait for another title at the oldest badminton tournament continues. 2024 had seemed a good chance to end the drought: especially with men's doubles top seeds Satwiksairaj Rankireddy and Chirag Shetty in red-hot form. However, they went out in the second round, as did PV Sindhu. Lakshya Sen, who reached the semifinals after a couple of stunning wins, was the last Indian standing while fellow men's singles players all lost in the first round. Here's a look at the takeaways for Indian badminton from 2024 All England, and what it means for the season ahead with the end of Paris Olympics qualifications on the horizon: Lakshya Sen rises again This All England marked a full circle, or rather, a triangle for Lakshya. Two years after his breakthrough, reaching the final of the 2022 edition, and two months after his lowest point on tour after seven straight first-round exits, Lakshya appears to have found his mojo back with two back-to-back semifinals. In Birmingham, he did a full 2022 throwback, beating world No 3 Anders Antonsen and 2021 champion Lee Zii Jia in tough three-game battles that brought out the best of his game - quick-footed and counterpunching, with the much-needed added element of composure. That he went down to Jonatan Christie in the semis may seem like a missed opportunity in an open field, but the 22-year-old has accomplished the much tougher task of overturning a mental slump. A deep run at a prestigious Super 1000 where the best players in the world struggled validates what his childhood coaches Vimal Kumar has been saying - physically his game was all there, it was a matter of confidence. The best part of this run is that the bounce was back in his step - he played a clean game with very good body language, something that had deserted him during his low period. This would have been the shot in the arm he needed, both for his game and his place in the race to Paris Olympics. Currently 15th in the BWF Race to Paris rankings, he needs to remain in the top 16 to qualify. Satwik-Chirag and men's doubles minefield The biggest upset from an Indian perspective was Satwik and Chirag losing in the second round in straight games. Muhammad Fikri and Bagas Maulana beat them 16-21, 15-21 to end their 5-match winning streak as well as their four-final run, playing a tactically smart game from the front court to outfox them. It wasn't a terrible result, though. They may have been the top seeds, but they lost to the 2022 All England champions, who then lost in the next round to the former world champions Soh-Chia. Meanwhile, the reigning world champions Seo-Kang lost in the first round and the second seeds Liang-Wang were also knocked out in the second round, by the reigning Olympic champions Lee-Wang. Simply put - this situation is reflective of the current men's doubles landscape, which has become increasingly competitive in the last couple of years and any pair can beat the other on their day. This in turn automatically makes player performance look more erratic that it is. Right now, there is not much to read into Satwik-Chirag's All England run except that they missed a major goal of 2024 - to reach the final of the Super 1000 they never have before. However, nothing motivates Satiwk-Chirag more than losses and this can add fuel to their fire in an important season. Sindhu has positives to count On paper, Sindhu had one walkover and lost the next match in Birmingham. On court, though, the second-round loss (19-21, 11-21) to world No 1 An Se Young is more than just an early exit. Yes, this was her seventh straight loss to the South Korean but it's a loss to take some heart from. Like in her loss to Olympic champion Chen Yu Fei at the French Open, Sindhu showed glimpses of her vintage self. She was quick on her feet, tactically more aware and played some brilliant shots to fight back and put herself in a good position against a tough opponent. This is more than she was able to throughout 2023, when she was coming back from a five-month injury layoff. Her comeback from the latest fourth-month injury layoff in February has started much better. Building up to the Paris Olympics, Sindhu raising hopes of returning to her pre-2022 surgery phase is one of the best takeaways for Indian badminton. What do we make of Prannoy's blip? HS Prannoy, who had the best year of his career in 2023, has been the only seeded Indian in singles for a while now by virtue of his consistency. In fact, he has already mathematically qualified for the Paris Olympics - his first ever - because of his steady run. However, the world no 8 has now lost three straight first-round matches on the BWF Tour, the last two to unheralded players. He reached the semifinal of the India Open Super 750 in January and won only one of three matches at the Badminton Asia Team Championship in February. It is too early to state if this a cause for concern and he himself must be disappointed with his loss -- having shared that his father has travelled to watch him at All England for the first time. He has not entered the next to BWF Super 300 events in Europe either, likely in an attempt at managing his fitness. Prannoy's form, though, is something to keep an eye on as the season progresses. The all-Indian women's doubles battle In women's doubles, there is an interesting battle brewing between Treesa Jolly and Gayatri Gopichand - who were the India No 1 pair for a long time before injury concerns pulled them behind in 2023 - and Tanisha Crasto and Ashwini Ponnappa, a newer pair who climbed up the ranks with a good end to 2023 - for the Paris Olympics qualification spot. This adds another layer to all their BWF World Tour performances. Currently, they are neck-to-neck at world No 22 and 23 in the world respectively but Tanisha-Ashwini are a little ahead at 11 to the other's 14 in the Olympics race. The top 16 spots usually qualify for the Olympics. At All England, Treesa and Gayatri lost in the first round, ending their streak of two straight semifinals, which will affect their points. Ashwini and Tanisha, meanwhile, beat a higher ranked pair and reached the second round of the Super 1000, which will give them a big boost. The cut-off is at the end of April, and this adds more intrigue to the Indian results in women's doubles."
    },
    {
        "Category": "Sports",
        "Article": "Jonatan Christie beats Lakshya Sen in three-game thriller, sets up All Indonesian final at 2024 All England Championships Jonatan Christie of Indonesia celebrates after winning the Men's Singles Semi Final against Lakshya Sen of India at the All England Open Badminton Championships 2024 Catherine Ivill/Getty Images The All England Championships will see an All Indonesian men's final in 2024 after Jonatan Christie beat India's Lakshya Sen 21-12, 10-21, 21-15 to join Anthony Ginting (who beat France's Christo Popov 19-21, 21-5, 21-11) in the title clash. In the second men's semi of the day, Christie started rapidly.. flying out of the blocks. spraying his trademark jump smashes across Lakshya's court (and body). It was close in the early stages, 6-6 as Lakshya kept up pace with the furious shot-making with some superb smashes of his own, but after opening up a four point lead at the mid-game break (11-7), Christie didn't really look back. Some delightful touches at the net and those smashes directed at the body kept Lakshya guessing and there was little he could do as he closed the game out with the first of his eight game points, taking it 21-12. The second started similarly with a quick exchange of points but 3-2 for Lakshya became 6-3 and then Christie completely broke down. All his smashes went well wide, his drops found the net or drifted out of bounds, even his regulation clears were wayward. Those that remain inbounds were dispatched superbly by the alert Lakshya and from 6-3, he took an incredible 17-4 lead. A mini rally for Christie got him six more points but by then Lakshya had also drawn away, and he closed out the game 21-10. Considering how near-perfect Christie had been in the first game, this was a strange, sudden reversal that Lakshya took the utmost advantage of. Ahead of the third game, the great Prakash Padukone, travelling with Lakshya (and PV Sindhu), was heard giving him some advice: \"[Christie] will come out fast early on, you have to be prepared for it\". And prepared he was as he went 2-0 up, and then 5-3 up... by now he was controlling the pace and intensity of the rallies and relying on a combination of his patience and Christie's wayward aggression to seize control of the game. Said control was short lived though as Christie changed up tactics to make it 6-6. He let go of the early smash-to-kill strategy that had won him the first game and lost him the second and adopted a more a patient approach, trusting his defence to open up gaps in Lakshya's armour. By the time 7-7 became 8-8 and then 10-8 in favour of Christie, he knew he had the upper hand. Going into the decisive mid-game break 11-9 up, he opened up his full array of strokes again -- one in particular, where he leaned back and hit an overhand inside-out smash that flew down the line at an angle that Lakshya neither predicted nor could do anything about. That smash made it 16-12 for Christie and from there it was routine as he made it 20-12. Despite Lakshya's late resistance saving three of those eight match points, Christie closed it out with a delicious drop angled cross-court. Lakshya's loss, meanwhile, meant that was the end of India's participation in Birmingham. Zenia D'Cunha will have her analysis of how the country's athletes fared this week up on the site by Sunday morning, but until then, you can relive the exciting semifinal (includes bits from the superb Akane Yamaguchi vs An Se Young semifinal that happened before this one) right here with our blog (Please wait a few seconds for the blog to load. If it doesn't please click here):"
    },
    {
        "Category": "Sports",
        "Article": "Lakshya Sen reaches All-England semifinal by returning to basics Lakshya Sen celebrates after winning the quarterfinal against Lee Zii Jia at the 2024 All England Badminton Championships. Catherine Ivill/Getty Images Two months ago, Lakshya Sen was mired in a terrible slump, looking lost after seven straight first-round exits on the BWF Tour. Today, Lakshya Sen has reached back-to-back semifinals in two straight weeks of the BWF Tour - at a Super 750 and Super 1000 tournament (the two highest tiers) looking supremely confident against some of the best players in the world. The 22-year-old Indian made the semis at the prestigious All England Championships after stunning comeback wins against world No. 3 Anders Antonsen and 2021 champion Lee Zii Jia in the span of two days. Against the Dane, he came back from a poor second game and 2-8 down in the decider to grab the final 8 points in his 24-22, 11-21, 21-14 win. Against the Malaysian, he fought back from a game down to win 20-22, 21-16, 21-19. The scoreline margins indicate how the final phase was a test of nerves as much as skill. Both times, he was the underdog and under pressure, both times he emerged victorious by being calm and playing his own game. Follow LIVE: Lakshya Sen vs Jonatan Christie The unseeded Indian showed the full range of his counter-punching prowess and speedy court-work, this time underlined by an exceptionally composed demeanour that has piled the pressure on his opponents as much as his skillful defence. He did that in Paris last week - where all his wins came from a game down - and he has backed it up in Birmingham, with the presence of childhood coaches Prakash Padukone and Vimal Kumar on the bench behind him. It's a complete U-turn and it's come at the best time possible - with the Paris Olympics looming closer. This Lakshya looks nothing like the dejected player at the India Open in January, plainly admitting that he was yet to process his latest loss to even think of the future. This Lakshya looked more like the 20-year-old breaking through the ranks back in 2022, reaching the final of All-England; beating Antonsen and Lee then as well. How did he turn it all around? In New Delhi, Vimal Kumar spoke about how Lakshya's issues were more mental than physical. His collapses stemmed from a lack of confidence rather than a technical glitch. The best way to solve them, the coach believed, was to not overthink but go back to his basics and put together a few wins. DIY: How childhood coach Vimal Kumar hopes Lakshya Sen can get his mojo back Conquering mental opponents is easier said than done but Lakshya has apparently managed to do just that. He is not only sticking to his basics of a quick, counter-punching game which can easily transition into attack when the opportunity arises, but he is doing it with complete confidence and composure. The 22-year-old did this multiple times against Lee, keeping the rallies on his racquet and forcing his opponent to do something extra while he remained steady. Lakshya was leading 8-3 to start the match before Lee reduced it to 9-8 and then levelled things at 12-12 and 16-16. They were battling it out in versatile rallies and smashed winners, with Lee often overhitting and Lakshya anticipating the errors. It was Lee who had three game points but Lakshya saved them all with great shots under pressure. On his fourth, he converted when Lakshya hit long - reiterating that the points were more often decided by the Indian's actions. The way Lee took the first game where Lakshya looked like the better player is a testament to the Malaysian's talent. Later however, the erratic tag that often describes him proved to be the difference. Lakshya, in the second game, stayed consistent and once again had the lead at the interval with more varied retrieving. The second half, however, was much closer with very small margins. Lee, looking to be the one to end points, committed a bunch of errors and got more cautious while Lakshya used the chance to force more mishits and eventually a decider. The Indian varied his pace and shots well to take charge of points. The decider was much tighter with no real lead to either player. But where Lee was sharp at the net and nailing smashes sporadically, Lakshya was constantly directing shots all over the court and had the interval lead once again as well as the momentum. The second half was not the cleanest of games but Lakshya's patience while Lee looked worried was a key difference. There was a superb rally at 13-16 where Lakshya won with his variety and smarts, a dogged defence ending with a smashed winner. Lee Zii Jia ���� competes against Lakshya Sen ���� in a hard-fought matchup.#BWFWorldTour #AllEngland2024 pic.twitter.com/wFqMCJh8G1 - BWF (@bwfmedia) March 16, 2024 But just as the Indian saw the finish line at 18-14, came the final twist as Lee levelled things at 19-19 with a cracking angled smash after a brief medical check for his arm. It was the moment of truth for Lakshya and those final 2 points went back to what coach Kumar had said so long ago. Lakshya forced Lee to mishit with quick parrying and then Lee pushed his return long, as he had so often in the match. Lakshya stuck to his basics and found confidence to reach the All-England semis once again - a full circle of sorts. Two years after his breakthrough and two months after his lowest point, Lakshya Sen discovered, or rather rediscovered, the core of what made him stand out as a badminton player. Next, he faces Jonathan Christie, whom he trails 1-2 in their head-to-head, for a place in the final. If he can continue playing his newfound old game, Lakshya can find something as precious at the oldest badminton tournament in the world."
    },
    {
        "Category": "Sports",
        "Article": "Sat-Chi and Sindhu headline India's push to end drought at All England Championship File photo of Satwik and Chirag Photo by How Foo Yeen/Getty Images The All England Championship, long seen as badminton's traditional holy grail - even after introduction of the World Championship and Olympic inclusion - holds a special significance in Indian badminton. Only two Indians have ever won the All England trophy - Prakash Padukone in 1980 and Pullela Gopichand in 2001. Incidentally, both will be at the 2024 edition, which starts on Tuesday in Birmingham, on the coach's chair. Padukone has been travelling on tour since last week's French Open Super 750, coaching PV Sindhu and Lakshya Sen, while Gopichand is the national coach with almost all other players. But it's not just their presence that raises hope of that drought ending this year; it's the performance of the world No 1 pair - Satwiksairaj Rankireddy and Chirag Shetty. Fresh from their dominant French Open title run on Sunday and having reached the final of all the BWF events they have played so far in 2024, the men's doubles pair are overwhelming favourites for another first in Indian badminton. Being a Super 1000 tournament, the All England also offers a chance for crucial points in the Olympic qualification race and a chance to build on the momentum from Paris, where four Indians reached the quarterfinals. The draws in Birmingham are admittedly tough for most Indians and playing for the second straight week will need them to be at their best. Here's a look at the Indian's draw and chances at All England 2024: Men's Doubles Satwiksairaj Rankireddy & Chirag Shetty vs Mohammad Ahsan & Hendra Setiawan Let's switch things around and start with the discipline all eyes will be on to end India's All England title drought. At the start of the year, Chirag had called this title one their 2024 goals: \"...that there are a couple of Super 1000s we haven't medalled at, the All England is one major tournament we have not played a final yet.\" The path to the final, though, won't be without big challenges. The top seeds face an interesting first-round battle - against the 'Daddies', Mohammad Ahsan and Hendra Setiawan, who lead the Indians 4-3 and had beaten them the last time they played. In a way, this is a clash between the past and present of men's doubles badminton as the Indonesian three-time world champions are 36 and 39 years of age, now unseeded against the most consistent pair of 2024. If Satwik and Chirag pass this early test, they could play 2022 champions Muhammad Shohibul Fikri and Bagas Maulana in the second round and former nemeses Aaron Chia and Soh Wooi Yik in the quarters. Men's doubles is a highly competitive space and the Indians have been the best at this year, reaching the finals of all the Super 1000 and Super 750 events so far. Fresh off a title and a target to achieve, it'll be hard not to see them as the favourites. Women's Singles PV Sindhu vs Yvonne Li Aakarshi Kashyap vs Pai Yu-po Another Indian star who is yet to reach the final of All England is PV Sindhu. The former world champion has made a solid return from the injury layoff and was playing close to her best last week at the French Open, where she lost to reigning Olympic champion Chen Yu Fei in a very close quarterfinal. In Birmingham, she starts against Germany's Yvonne Li, against whom she has a 2-0 record. But the real challenge comes early with a potential clash against world No 1 and defending champion An Se Young, whom she has never beaten before. Can the seventh time be the charm? Also in action will be Akarshi Kahsyap, who plays Pai Yu Po in the first round with a possible clash against eighth seed Han Yue if she reached the second. Men's Singles HS Prannoy vs Su Li-yang Lakshya Sen vs Ng Tze Yong Srikanth Kidambi vs Viktor Axelsen Priyanshu Rajawat vs Chico Aura Dwi Wardoyo Lakshya, who rediscovered his touch with an impressive run to the semifinal last week, is the 2022 runner-up at All England and would want to build on his newly found momentum. He is slated to play Ng Tze Yong, who he has a solid 4-0 record against, but the Malaysian could withdraw. He faces a potential tricky second round against fourth seed Anders Antonsen. HS Prannoy, the only seeded Indian in singles, faced a first-round exit at the French Open to Lu Guang Zu, and will be keen to get going this week. He starts against Chinese Taipei's Su Li-yang in what will be their first meeting. The other seed in his quarter is Li Shi Feng, who lost to Lakshya last week. Srikanth, who beat Chou Tien Chen but lost to Lu last week, has the most difficult draw on paper - facing top seed Viktor Axelsen. However, Axelsen has not been his formidable self this season and lost in the second round in Paris. If Srikanth has to make a big push for points, this is the time to upset the Dane who leads him 10-3. Priyanshu Rajawat starts against Chico Aura Dwi Wardoyo, who reached the semis in Paris and has beaten the Indian in their only meeting. A win will put him on collision course with second seed and French Open champion Shi Yu Qi. Women's Doubles Treesa Jolly & Gayatri Gopichand vs Apriyani Rahayu & Siti Fadia Silva Ramadhanti Tanisha Crasto & Ashwini Ponnappa vs Yeung Nga Ting & Yeung Pui Lam Swetaparna Panda & Rutaparna Panda vs Rin Iwanaga & Kie Nakanishi Treesa Jolly and Gayatri Gopichand, still on the comeback trail after missing a large chunk of the last season, have had their best results on tour at the All England - reaching the semis in the last two editions. Looking for Olympic qualification, the 20-year-old will hope for a hattrick of deep runs. But a very tough draw awaits them, starting with Indonesian combination of Apriyani Rahayu and Siti Fadia Silva Ramadhanti who lead them 2-0. A win will pit them against eighth seeds Mayu Matsumoto and Wakana Nagahara while the inevitable world No 1 pair of Chen Qing Chen and Jia Yi Fan await in their quarter. The other women's doubles pair of Tanisha Crasto and Ashwini Ponnappa, also looking for Olympic qualification, play Hong Kong's Yeung Nga Ting and Yeung Pui Lam. The Indians beat them at the Badminton Asia Championship last month and will likely play fifth seeds Zhang Shu Xian and Zheng Yu if they win again. The Panda sisters, Rutaparna and Swetaparna, have also made the cut and start against Rin Iwanaga and Kie Nakanishi of Japan in what is their first meeting. A win means a second-round clash against second seeds Baek Ha Na and Lee So Hee."
    },
    {
        "Category": "Sports",
        "Article": "Today's NBA is harder on LeBron James, Steph Curry than ever before Sunday afternoon after a valuable victory for the Los Angeles Lakers in New Orleans, LeBron James asked aloud how many games he ended up playing in his just-concluded 21st NBA regular season. The answer was officially 71, but really 72 if counting the in-season tournament championship game which awkwardly isn't counted. That's 16 (17, unofficially) more games than last season and the most in his six-year tenure with the Lakers. James shook his head in satisfaction. \"That's pretty cool,\" James said. \"At this point in my career to play 70-plus games and be available for my guys.\" This is reality. To be 39 years old, the oldest active player in the league, and dealing with some chronic injuries to his left ankle and right foot and long-term maintenance of other areas such as his lower back, to play that many games is indeed cool. The Lakers finished the regular season 47-35, four games better than last season, and James thought that was pretty good, too. \"To end the season 12 games over .500, 13 if you count the championship of in-season tournament, for everything we went through,\" James said, \"it's a pretty good season for us.\" This is reality, too. The Lakers finished the season winning 13 of their last 18 games and slipped into eighth in the West at the finish line after spending months stuck in ninth or lower. But for James, reality is easily skewed. He doesn't live in a world where \"good\" seasons are accepted at face value. He shares this status with 36-year-old Steph Curry, who will also compete in Tuesday's play-in tournament. The Golden State Warriors will play the Sacramento Kings just after James takes on the New Orleans Pelicans as the West teams fight to gain entry to the playoffs. James and Curry are superstars of a certain age. Their dominance in their primes and extended run of winning at the highest level has made anything less than that seem like failure. Between 2011 and 2022, either James or Curry played in the Finals for 11 out of 12 years. They played against each other four times. Last season, they played in a series that smashed television ratings records as the Lakers won and James reached his 12th career conference finals. When this is your résumé, you aren't afforded the luxury of simply maximizing your current team's chances. James and Curry are judged aggressively both against ghost adversaries who have long retired and against themselves when they were younger, healthier and played in a less competitive league. \"This last 30 games has just been 'Operation: Give ourselves a chance,'\" Curry said last week. \"You could look at it a lot of different ways. You could look at our record [down the stretch] and extrapolate that out for 82 games and you're probably not in this situation. But all the things we've gone through and the way the West is stacked, that's our situation. Doesn't really matter.\" The Warriors were 19-24 in late January with Draymond Green suspended, Chris Paul injured and Klay Thompson stuck in a long slump. Stories leaked about role players undermining coach Steve Kerr, and Curry himself was quoting the definition of insanity. The Warriors then went 27-12 to finish the season. But if they lose one of their next two games, they will surely sit through a torrent of \"end of the road\" storylines. In 2016, when they blasted the league en route to 73 wins, the Warriors' current 46-36 record would've had them in the No. 5 seed. The conference's depth now is totally different, and the margin for error is the tightest it has been in the past two decades. \"This whole season has been weird,\" Curry said. The Lakers just completed their second-best regular season in the past 13 years, behind only the 52-win season in 2019-20 that ended in a title. This season, if they have a bad week, James and the Lakers will deal with heavy fallout simply because of the expectations that have been established for the franchise. Like the Warriors, the Lakers will be awarded no bonus points based on a perspective that looks at the entire lay of the land. \"I took a lot of pride in the offseason in getting my foot, my ankle back in order, getting my body back in order,\" James said. \"And it's definitely paid off for me.\" In addition to getting healthier, James adjusted his shooting form and finished the season at 41% from 3-point range, the best of his career. This will end up being a footnote to a footnote. Curry played in 74 games, his most in seven seasons. He had his 10th season of shooting at least 45% overall, 40% from 3 and 90% from the line. But there is next to no interest in this statistic -- Curry normalized great shooting years ago. Instead, he and James will eventually trudge off to the summer, likely listening to plenty of talk about how they've won their last NBA championships ... when they join up in Paris for Team USA in an attempt to win an Olympic gold medal. This is James and Curry's existence. They are used to heavy expectations and doomsday predictions, and the presumption will be no different this week. \"You can't avoid those conversations; they've been hovering over us [for years],\" Curry said Monday. \"When you're out on the floor as a player performing at that level and understanding what's expected of yourself and your team, that environment brings the best out of you.\""
    },
    {
        "Category": "Sports",
        "Article": "NBA playoff experts' picks: Predicting Lakers-Pelicans, Kings-Warriors and every play-in game play Mike Greenberg, Tim Legler and Alan Hahn discuss the pros and cons of the Lakers resting their starters vs. the Pelicans in the play-in tournament. (2:10) The NBA play-in tournament begins Tuesday, featuring two of the game's biggest stars each fighting to secure a spot in the first round. Before LeBron James' Los Angeles Lakers take on the New Orleans Pelicans and Stephen Curry's Golden State Warriors face the Sacramento Kings, our NBA experts are making their picks for the play-in games, including Wednesday's Miami Heat-Philadelphia 76ers and Chicago Bulls-Atlanta Hawks showdowns in the Eastern Conference. MORE: 20-team preview | Playoff news, schedules and results Los Angeles Lakers (8) at New Orleans Pelicans (7) Kendra Andrews: Lakers Jerry Bembry: Lakers Israel Gutierrez: Pelicans Chris Herring: Lakers Tim Legler: Pelicans Tim MacMahon: Lakers Bobby Marks: Lakers Dave McMenamin: Lakers Kevin Pelton: Pelicans Jorge Sedano: Lakers André Snellings: Lakers Marc J. Spears: Lakers Ohm Youngmisuk: Lakers Final tally: Lakers 10, Pelicans 3. Golden State Warriors (10) at Sacramento Kings (9) Kendra Andrews: Warriors Jerry Bembry: Warriors Israel Gutierrez: Warriors Chris Herring: Warriors Tim Legler: Warriors Andrew Lopez: Kings Tim MacMahon: Warriors Bobby Marks: Warriors Dave McMenamin: Warriors Kevin Pelton: Warriors Jorge Sedano: Warriors André Snellings: Warriors Marc J. Spears: Warriors Ohm Youngmisuk: Warriors Final tally: Warriors 13, Kings 1. Miami Heat (8) at Philadelphia 76ers (7) Kendra Andrews: 76ers Jerry Bembry: 76ers Israel Gutierrez: Heat Chris Herring: 76ers Tim Legler: 76ers Andrew Lopez: 76ers Tim MacMahon: 76ers Bobby Marks: Heat Dave McMenamin: 76ers Kevin Pelton: 76ers Jorge Sedano: Heat André Snellings: 76ers Marc J. Spears: 76ers Ohm Youngmisuk: 76ers Final tally: 76ers 11, Heat 3. Atlanta Hawks (10) at Chicago Bulls (9) Kendra Andrews: Bulls Jerry Bembry: Bulls Israel Gutierrez: Bulls Chris Herring: Bulls Andrew Lopez: Bulls Tim Legler: Bulls Tim MacMahon: Bulls Bobby Marks: Bulls Dave McMenamin: Bulls Kevin Pelton: Bulls Jorge Sedano: Bulls André Snellings: Bulls Marc J. Spears: Bulls Ohm Youngmisuk: Bulls Final tally: Bulls 14, Hawks 0."
    },
    {
        "Category": "Sports",
        "Article": "Sources: Bucks preparing to be without Giannis Antetokounmpo The Milwaukee Bucks are preparing to be without two-time MVP Giannis Antetokounmpo for the start of their Eastern Conference first-round series against the Indiana Pacers, but are hopeful treatment on his left calf strain will allow him to return sometime later in the series, sources told ESPN on Tuesday. Antetokounmpo has been undergoing around-the-clock treatment on the calf, sources said. The third-seeded Bucks open the series against the sixth-seeded Pacers on Sunday in Milwaukee. The Pacers won four of five regular-season games against the Bucks. Antetokounmpo missed the final three regular-season games after crumpling to the floor with a noncontact injury a week ago against the Boston Celtics. Antetokounmpo ended the regular season averaging 30.4 points on a career-best 61% shooting with 11.5 rebounds and 6.5 assists. He's the first player in NBA history to average 30 points per game on 60% shooting, according to research by ESPN Stats & Information."
    },
    {
        "Category": "Sports",
        "Article": "Sources: Suns coach Kevin Young finalizing deal to lead BYU Phoenix Suns associate head coach Kevin Young is finalizing a long-term deal to become the next coach at Brigham Young University, sources told ESPN on Tuesday. Young -- the highest paid assistant in the NBA -- had been a significant candidate for league head coaching jobs in the past two hiring cycles, but BYU landed him with a sizable commitment to lead the Cougars into their second Big 12 Conference season and beyond. Young replaces Mark Pope, who left for the Kentucky job after delivering BYU an NCAA tournament bid in their inaugural Big 12 season. Young, who was born in Salt Lake City, will continue working with the Suns in the playoffs, but will begin assembling a coaching staff that'll immediately start recruiting for BYU, sources said. Young spent eight years coaching in the NBA G League -- including head-coaching jobs with the Utah Flash, Iowa Energy and Delaware 87ers. Young began to gain momentum as a head-coaching candidate in openings a year ago, including interviews with the Milwaukee Bucks, Toronto Raptors, Houston Rockets and Suns. Young previously interviewed for head-coaching jobs with the Philadelphia 76ers, Utah Jazz and Washington Wizards. The Charlotte Hornets and Brooklyn Nets interviewed him for jobs this spring too, sources said. Young started his coaching career in 2007 as an assistant at Utah Valley University."
    },
    {
        "Category": "Sports",
        "Article": "Sources: Nets prepared to hire Kings' Jordi Fernandez as coach Jordi Fernandez has emerged as the Brooklyn Nets' choice to become the franchise's next coach, separating himself amid a wide, monthlong search that now has the Nets prepared to hire the Sacramento Kings' top assistant, sources told ESPN on Monday night. Fernandez, 41, has been a fast-rising coaching candidate in the past two years and will land the Nets' head-coaching job, sources said. Fernandez will take over a Nets franchise that completed a 32-50 season under interim coach Kevin Ollie -- its fifth coach since 2020. Brooklyn is reshaping its team in the post-Kevin Durant-Kyrie Irving era and is hiring Fernandez to reinvigorate a roster that includes Mikal Bridges, Cam Thomas, Nic Claxton, Cameron Johnson and Noah Clowney. Nets general manager Sean Marks met with dozens of candidates in recent weeks and Fernandez advanced to meet with owner Joe Tsai recently, sources said. Fernandez will continue to coach the Kings for the rest of the season, sources said. Sacramento plays the Warriors in Tuesday's Western Conference 9-10 play-in tournament game. Fernandez was part of 2023 NBA Coach of the Year Mike Brown's revival with the Kings and began building his head-coaching candidacy in stops with Denver for six seasons under Michael Malone and with the Cleveland Cavaliers. Fernandez's medal-winning work as the Canadian national coach at the 2023 FIBA World Cup made league executives begin to examine him further as one of the league's top young assistants. Fernandez, a Barcelona, Spain native, interviewed for head-coaching jobs with Toronto, Phoenix and Milwaukee last year. Fernandez has previously coached in national team programs for Spain and Nigeria."
    }
]